In [3]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('D:\Study\Fundamentals of Data Science\Practicals\Practical Exam\DatasetWithNullValues.csv')

In [7]:
print(df)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [8]:
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [9]:
#df.notnull()
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [10]:
#Fillnull values with the previous ones
df.fillna(method ='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [11]:
#Fillnull values with the afters ones
df.fillna(method ='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [12]:
#replace()
df.replace(to_replace = np.nan, value = -99)

   First Score  Second Score  Third Score
0        100.0          30.0        -99.0
1         90.0          45.0         40.0
2        -99.0          56.0         80.0
3         95.0         -99.0         98.0

In [13]:
#Using interpolate() function to fill the missing values using linear method.
df.interpolate(method ='linear', limit_direction ='forward')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         92.5          56.0         80.0
3         95.0          56.0         98.0

In [14]:
#dropna()
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [15]:
#Concatenate
import pandas as pd  
a_data = pd.Series(['p', 'q'])  
b_data = pd.Series(['r', 's'])  
pd.concat([a_data, b_data])

0    p
1    q
0    r
1    s
dtype: object